# Tehtävä 1 (1/2) Titanic-data

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Grafiikan tyylimääritys
plt.style.use('seaborn-whitegrid')

## Frekvenssitaulukon muotoilu
format = {"f":"{:.0f}", "%":"{:.1f}"}

# Datan tuominen ja avaaminen
df = pd.read_excel('https://taanila.fi/titanic.xlsx')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [2]:
# Datan tarkastelu
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [3]:
# Frekvenssijaukauma survived-muuttujalle

df1 = pd.crosstab(df['survived'], "f")
df1.columns.name = ""

## Laitetaan 0 ja 1 tilalle se, mitä ne tarkoitti (kuoli/selviytyi)
df1.index = ['Ei selviytynyt', 'Selviytyi']

## Prosentit
n1 = df1['f'].sum()
df1["%"] = df1["f"]/n1*100

# Formatoidaan prosentit
df1.style.format(format)

In [7]:
# Selvitetään frekvenssijakauma hyttiluokista

df2 = pd.crosstab(df['pclass'], "f")
df2.columns.name = ""

## Laitetaan hyttiluokat
df2.index = ['1', '2', "3"]

## Prosentit
n1 = df2['f'].sum()
df2["%"] = df2["f"]/n1*100
df2.style.format(format)

In [8]:
# Frekvenssijaukauma sukupuolelle

df3 = pd.crosstab(df['sex'], "f")
df3.columns.name = ""



## Prosentit
n1 = df1['f'].sum()
df3["%"] = df3["f"]/n1*100
df3.style.format(format)